In [61]:
# %matplotlib inline
import pandas as pd
import numpy as np

### Connect Pandas to the database with this URL:

In [3]:
titles = pd.read_csv('titles.csv')
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [4]:
cast = pd.read_csv('cast.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### How many movies are listed in the titles dataframe?

In [11]:
titles['title'].value_counts().count()

212418

### What are the earliest two films listed in the titles dataframe?

In [12]:
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [13]:
titles.sort_values(by='year').head(2)

                     title  year
177757          Miss Jerry  1894
215272  The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [20]:
titles[titles['title']=='Hamlet'].count()

title    18
year     18
dtype: int64

### How many movies are titled "North by Northwest"?

In [21]:
titles[titles['title']=='North by Northwest'].count()

title    1
year     1
dtype: int64

### When was the first movie titled "Hamlet" made?

In [24]:
ham=titles[titles['title']=='Hamlet']
ham

         title  year
6009    Hamlet  1948
45350   Hamlet  1990
46721   Hamlet  1910
92146   Hamlet  1976
94355   Hamlet  1987
94554   Hamlet  2000
98554   Hamlet  1921
102919  Hamlet  2011
122704  Hamlet  1969
128388  Hamlet  1954
166410  Hamlet  1913
168965  Hamlet  2015
176069  Hamlet  2009
182970  Hamlet  1964
201291  Hamlet  1996
209878  Hamlet  1911
221479  Hamlet  1973
223568  Hamlet  2014

In [26]:
ham.sort_values(by='year').head(2)

         title  year
46721   Hamlet  1910
209878  Hamlet  1911

### List all of the "Treasure Island" movies from earliest to most recent.

In [28]:
Tre=titles[titles['title']=='Treasure Island']

In [29]:
Tre.sort_values(by='year')

                  title  year
206027  Treasure Island  1918
51287   Treasure Island  1920
191050  Treasure Island  1934
96934   Treasure Island  1950
89534   Treasure Island  1972
111343  Treasure Island  1973
205397  Treasure Island  1985
179354  Treasure Island  1999

### How many movies were made in the year 1950?

In [40]:
titles.head()
titles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 232330 entries, 0 to 232329
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   title   232330 non-null  object
 1   year    232330 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.5+ MB

In [43]:
titles[titles['year']== 1950].count()

title    1099
year     1099
dtype: int64

### How many movies were made in the year 1960?

In [44]:
titles[titles['year']== 1960].count()

title    1501
year     1501
dtype: int64

### How many movies were made from 1950 through 1959?

In [46]:
titles[(titles['year']> 1950) & (titles['year']< 1960)].count()

title    11612
year     11612
dtype: int64

### In what years has a movie titled "Batman" been released?

In [47]:
titles[titles['title']=='Batman']

        title  year
56000  Batman  1989
74608  Batman  1943

### How many roles were there in the movie "Inception"?

In [48]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [67]:
incept=cast[cast.title=='Inception']

In [55]:
cast['character'][cast.title=='Inception'].value_counts().shape
# we have 55 rows

(55,)

In [57]:
cast[(cast.title=='Inception')& (cast.character=='Bridge Sub Con')]

             title  year                 name     type       character     n
251777   Inception  2010       Virgile Bramly    actor  Bridge Sub Con  29.0
420630   Inception  2010        Nicolas Clerc    actor  Bridge Sub Con  26.0
501768   Inception  2010   Jean-Michel Dagory    actor  Bridge Sub Con  30.0
811450   Inception  2010    Daniel Girondeaud    actor  Bridge Sub Con   NaN
1863454  Inception  2010  Benjamin (II) Riley    actor  Bridge Sub Con   NaN
2714054  Inception  2010     Coralie Dedykere  actress  Bridge Sub Con  27.0
3038305  Inception  2010        Silvie Laguna  actress  Bridge Sub Con  28.0

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [59]:
cast[cast.title=='Inception'].head()

,title,year,name,type,character,n
94937,Inception,2010,Michael (III) August,actor,LAX Passenger,NaN
144039,Inception,2010,Peter Basham,actor,Fischer's Jet Captain,44.0
177911,Inception,2010,Tom Berenger,actor,Browning,8.0
191432,Inception,2010,Ken Bhan,actor,Mombasan Gambler,NaN
251777,Inception,2010,Virgile Bramly,actor,Bridge Sub Con,29.0

In [76]:
incept[incept['n'].isnull()].count()
# 26 rows have the null values

title        26
year         26
name         26
type         26
character    26
n             0
dtype: int64

In [70]:
cast.isna()

,title,year,name,type,character,n
0,Closet Monster,2015,Buffy #1,actor,Buffy 4,NaN
3,Secret in Their Eyes,2015,$hutter,actor,2002 Dodger Fan,NaN
4,Steve Jobs,2015,$hutter,actor,1988 Opera House Patron,NaN
5,Straight Outta Compton,2015,$hutter,actor,Club Patron,NaN
6,Straight Outta Compton,2015,$hutter,actor,Dopeman,NaN
...,...,...,...,...,...,...
3634452,Svanurinn,2017,Katla M. ?orgeirsd?ttir,actress,?l?f,NaN
3634457,Foreldrar,2007,Lilja Gu?r?n ?orvaldsd?ttir,actress,Katrin Eldri,NaN
3634458,Rokland,2011,Lilja Gu?r?n ?orvaldsd?ttir,actress,A?albj?rg - Dagga's Mother,NaN
3634459,XL,2013,Lilja Gu?r?n ?orvaldsd?ttir,actress,Tengdamamma,NaN
3634466,Bye Bye Blue Bird,1999,Rosa ? R?gvu,actress,Pensionatv?rtinde,NaN

### But how many roles in the movie "Inception" did receive an "n" value?

In [77]:
incept[~incept['n'].isnull()].count()
# they are 51

title        51
year         51
name         51
type         51
character    51
n            51
dtype: int64

In [113]:
incept

,title,year,name,type,character,n
94937,Inception,2010,Michael (III) August,actor,LAX Passenger,NaN
144039,Inception,2010,Peter Basham,actor,Fischer's Jet Captain,44.0
177911,Inception,2010,Tom Berenger,actor,Browning,8.0
191432,Inception,2010,Ken Bhan,actor,Mombasan Gambler,NaN
251777,Inception,2010,Virgile Bramly,actor,Bridge Sub Con,29.0
...,...,...,...,...,...,...
3259597,Inception,2010,Ellen Page,actress,Ariadne,3.0
3313720,Inception,2010,Nicole Pulliam,actress,Lobby Sub Con,43.0
3340319,Inception,2010,Lisa (II) Reynolds,actress,Private Nurse,48.0
3347057,Inception,2010,Talulah Riley,actress,Blonde,25.0
3582980,Inception,2010,Shannon Welles,actress,Old Mal,51.0

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [81]:
cast[(cast.title=='North by Northwest')& (~cast['n'].isnull()) ].sort_values(by='n')

,title,year,name,type,character,n
845516,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3382934,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1413409,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3043261,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
345822,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
2941468,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
1644542,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
1236791,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
2372617,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
1757154,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
646039,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
2225858,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
450691,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
1463316,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
199768,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1343025,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [82]:
cast[(cast.title=='Sleuth')& (cast.year==1972) ].sort_values(by='n')

,title,year,name,type,character,n
1654402,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
316652,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
362592,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1421434,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2635708,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1405219,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [83]:
cast[(cast.title=='Sleuth')& (cast.year==2007) ].sort_values(by='n')

          title  year                 name     type          character    n
316653   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1254632  Sleuth  2007             Jude Law    actor               Milo  2.0
1751872  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
251883   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
362593   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2635707  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3244050  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [86]:
cast[(cast.title=='Hamlet')& (cast.year==1921) ].count()

title        9
year         9
name         9
type         9
character    9
n            9
dtype: int64

### How many roles were credited in Branagh’s 1996 Hamlet?

### How many "Hamlet" roles have been listed in all film credits through history?

In [89]:
cast[cast.character=='Hamlet'].count()

title        92
year         92
name         92
type         92
character    92
n            55
dtype: int64

### How many people have played an "Ophelia"?

In [101]:
Op=cast[cast.character=='Ophelia']
Op.count()

title        111
year         111
name         111
type         111
character    111
n             59
dtype: int64

In [99]:
Op.name.value_counts().count()
# 109 people have played Ophelia

109

### How many people have played a role called "The Dude"?

### How many people have played a role called "The Stranger"?

### How many roles has Sidney Poitier played throughout his career?

### How many roles has Judi Dench played?

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

### List the leading roles that Cary Grant played in the 1940s in order by year.

### How many roles were available for actors in the 1950s?

### How many roles were avilable for actresses in the 1950s?

### How many leading roles (n=1) were available from the beginning of film history through 1980?

### How many non-leading roles were available through from the beginning of film history through 1980?

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [105]:
cast[ (cast.year== 1980)&(cast['n'].isnull())].count()

title        4239
year         4239
name         4239
type         4239
character    4239
n               0
dtype: int64